/*-----------------------------------------------------------------------------------------------------
【平    台】龙邱K60核心板-智能车板
【编    写】LQ-005
【E-mail  】chiusir@163.com
【软件版本】V1.0，龙邱开源代码，仅供参考，后果自负
【最后更新】2019年04月02日
【网    站】http://www.lqist.cn
【淘宝店铺】http://shop36265907.taobao.com
【编译平台】IAR 8.2
【功    能】systick定时器例子
【注意事项】
-------------------------------------------------------------------------------------------------------*/
#include "include.h"
#include "LQ_SYSTICK.h"

/*------------------------------------------------------------------------------------------------------
【函    数】Test_Systick
【功    能】测试systick定时器
【参    数】无
【返 回 值】无
【实    例】Test_Systick(); //测试systick定时器
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_Systick(void)
{
    LED_Init();                          //LED初始化
    systime.init();                      //开启systick定时器
    uint64_t nowtime = 0;
    nowtime = systime.get_time_us();
    while(1)
    {
        
        if(systime.get_time_us() - nowtime >= 5000)
        {
            LED_Reverse(0);             //用示波器测A17频率 100Hz 用于测试PIT计时器是否准确
            nowtime = systime.get_time_us();
        }
    }
    
}